toasterllc/MDCCode/Code/STM32/Shared/USB.h
    static uint8_t* _USBD_GetFSConfigDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    static uint8_t* _USBD_GetOtherSpeedConfigDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    static uint8_t* _USBD_GetDeviceQualifierDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    static uint8_t* _USBD_GetUsrStrDescriptor(uint8_t index, uint16_t* len) {
        return nullptr;
    }
    
    static _OutEndpoint& _OutEndpointGet(uint8_t ep) {
        if constexpr (EndpointCountOut()) {
            return _OutEndpoints[EndpointIdx(ep)-1];
        }
        abort();
    }
    
//    static const _OutEndpoint& _OutEndpointGet(uint8_t ep) {
//        if constexpr (EndpointCountOut()) {
//            return _OutEndpoints[EndpointIdx(ep)-1];
//        }
//        abort();
////        return const_cast<const _OutEndpoint&>(std::as_const(*this)._OutEndpointGet(ep));
//    }
    
    static _InEndpoint& _InEndpointGet(uint8_t ep) {
        if constexpr (EndpointCountIn()) {
            return _InEndpoints[EndpointIdx(ep)-1];
        }
        abort();
    }
    
    template <typename T>
    struct _EndpointWaitResult {
        bool done = false;
        T result = {};
        operator bool() const { return done; }
    };
    
    static _EndpointWaitResult<std::optional<size_t>> _EndpointWait(uint8_t ep, _OutEndpoint& outep) {
        Toastbox::IntState ints(false);
        switch (outep.state) {
        case _EndpointState::Busy:
            // Still waiting for completion
            return { false };
        case _EndpointState::Done:
            // Done, success
            _AdvanceState(ep, outep);
            return { true, _RecvLen(outep) };
        default:
            // Done, failed
            return { true, std::nullopt };
        }
    }
    
    static _EndpointWaitResult<bool> _EndpointWait(uint8_t ep, _InEndpoint& inep) {
        Toastbox::IntState ints(false);
        switch (inep.state) {
        case _EndpointState::Busy:
            // Still waiting for completion
            return { false };
        case _EndpointState::Done:
            // Done, success
            _AdvanceState(ep, inep);
            return { true, true };
        default:
            // Done, failed
            return { true, false };
        }
    }
    
//    static const _InEndpoint& _InEndpointGet(uint8_t ep) {
//        if constexpr (EndpointCountIn()) {
//            return _InEndpoints[EndpointIdx(ep)-1];
//        }
//        abort();
////        return const_cast<const _InEndpoint&>(std::as_const(*this)._InEndpointGet(ep));
//    }
    
    // Interrupts must be disabled
    static void _EndpointReset(uint8_t ep) {
        if (_State != State::Connected) return; // Short-circuit if we're not Connected
        
        if (EndpointOut(ep)) {
            _OutEndpoint& outep = _OutEndpointGet(ep);
            if (_Ready(outep))  _EndpointReset(ep, outep);
            else                outep.needsReset = true;
        
        } else {
            _InEndpoint& inep = _InEndpointGet(ep);
            if (_Ready(inep))   _EndpointReset(ep, inep);
            else                inep.needsReset = true;
        }
    }
    
    // Interrupts must be disabled
    static bool _EndpointReady(uint8_t ep) {
        if (_State != State::Connected) return false; // Short-circuit if we're not Connected
        if (EndpointOut(ep))    return _Ready(_OutEndpointGet(ep));
        else                    return _Ready(_InEndpointGet(ep));
    }
    
    // Interrupts must be disabled
    static bool _Ready(const _OutEndpoint& outep)            { return outep.state==_EndpointState::Ready;  }
    static bool _Ready(const _InEndpoint& inep)              { return inep.state==_EndpointState::Ready;   }
    static bool _Busy(const _OutEndpoint& outep)             { return outep.state==_EndpointState::Busy;   }
    static bool _Busy(const _InEndpoint& inep)               { return inep.state==_EndpointState::Busy;    }
    static bool _Done(const _OutEndpoint& outep)             { return outep.state==_EndpointState::Done;   }
    static bool _Done(const _InEndpoint& inep)               { return inep.state==_EndpointState::Done;    }
    
    static size_t _RecvLen(const _OutEndpoint& outep)        { return outep.len;                           }
    
    // Interrupts must be disabled
    template <typename OutInEndpoint>
    static void _EndpointReset(uint8_t ep, OutInEndpoint& outinep) {
        outinep.state = _EndpointState::Reset;
        outinep.needsReset = false;
        _AdvanceState(ep, outinep);
    }
    
    // Interrupts must be disabled
    static void _AdvanceState(uint8_t ep, _OutEndpoint& outep) {
        if (outep.needsReset) {
            _EndpointReset(ep, outep);
            return;
        }
        
        outep.len = USBD_LL_GetRxDataSize(&_Device, ep);
        
        // State transitions
        switch (outep.state) {
        case _EndpointState::Ready:     outep.state = _EndpointState::Busy; break;
        case _EndpointState::Busy:      outep.state = _EndpointState::Done; break;
        case _EndpointState::Done:      outep.state = _EndpointState::Ready; break;
        case _EndpointState::Reset:     outep.state = _EndpointState::ResetZLP1; break;
        case _EndpointState::ResetZLP1:
            // Only advance if we received a ZLP
            if (outep.len == 0) outep.state = _EndpointState::ResetSentinel;
            break;
        case _EndpointState::ResetSentinel:
            // Only advance if we received the sentinel
            if (outep.len == sizeof(_ResetSentinel)) outep.state = _EndpointState::Ready;
            break;
        default:
            abort();
        }
        
        // State actions
        switch (outep.state) {
        case _EndpointState::ResetZLP1:
        case _EndpointState::ResetSentinel:
            USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)_DevNullAddr, MaxPacketSizeBulk);
            break;
        default:
            break;
        }
    }
    
    // Interrupts must be disabled
    static void _AdvanceState(uint8_t ep, _InEndpoint& inep) {
        if (inep.needsReset) {
            _EndpointReset(ep, inep);
            return;
        }
        
        // We send two ZLPs (instead of just one) because if a transfer is in progress, the first ZLP will
        // get 'eaten' as a ZLP that terminates the existing transfer. So to guarantee that the reader
        // actually gets a ZLP, we have to send two.
        // After sending the two ZLPs, we also send a sentinel to account for the fact that we don't know
        // how many ZLPs that the reader will receive, because we don't know if the first ZLP will
        // necessarily terminate a transfer (because a transfer may not have been in progress, or if a
        // transfer was in progress, it may have sent exactly the number of bytes that the reader
        // requested, in which case no ZLP is needed to end the transfer). By using a sentinel, the
        // reader knows that no further ZLPs will be received after the sentinel has been received, and
        // therefore the endpoint is finished being reset.
        
